In [1]:
import numpy as np
import pandas as pd

In [2]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

df

                   A         B         C         D
2013-01-01 -0.264451 -1.224803 -0.103563 -0.020063
2013-01-02  0.044198  0.530909 -1.323004  2.187266
2013-01-03 -0.274098 -0.386112  1.312149 -0.735471
2013-01-04  0.844243  0.335021  2.066941  0.469638
2013-01-05 -0.097006 -0.061110 -0.025597 -0.371248
2013-01-06 -1.208825  0.715429  0.355888 -1.138096

In [3]:
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [4]:
df['A']

2013-01-01   -0.264451
2013-01-02    0.044198
2013-01-03   -0.274098
2013-01-04    0.844243
2013-01-05   -0.097006
2013-01-06   -1.208825
Freq: D, Name: A, dtype: float64

In [6]:
df.A

2013-01-01   -0.264451
2013-01-02    0.044198
2013-01-03   -0.274098
2013-01-04    0.844243
2013-01-05   -0.097006
2013-01-06   -1.208825
Freq: D, Name: A, dtype: float64

In [12]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.264451 -1.224803 -0.103563 -0.020063
2013-01-02  0.044198  0.530909 -1.323004  2.187266
2013-01-03 -0.274098 -0.386112  1.312149 -0.735471

In [11]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.044198  0.530909 -1.323004  2.187266
2013-01-03 -0.274098 -0.386112  1.312149 -0.735471
2013-01-04  0.844243  0.335021  2.066941  0.469638

In [18]:
df

                   A         B         C         D
2013-01-01 -0.264451 -1.224803 -0.103563 -0.020063
2013-01-02  0.044198  0.530909 -1.323004  2.187266
2013-01-03 -0.274098 -0.386112  1.312149 -0.735471
2013-01-04  0.844243  0.335021  2.066941  0.469638
2013-01-05 -0.097006 -0.061110 -0.025597 -0.371248
2013-01-06 -1.208825  0.715429  0.355888 -1.138096

In [23]:
# df.iloc[row, index]
#df.loc['row, index name']
print(df.iloc[0])
print(df.loc['2013-01-01'])

A   -0.264451
B   -1.224803
C   -0.103563
D   -0.020063
Name: 2013-01-01 00:00:00, dtype: float64
A   -0.264451
B   -1.224803
C   -0.103563
D   -0.020063
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.264451 -1.224803
2013-01-02  0.044198  0.530909
2013-01-03 -0.274098 -0.386112
2013-01-04  0.844243  0.335021
2013-01-05 -0.097006 -0.061110
2013-01-06 -1.208825  0.715429

In [25]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.044198  0.530909
2013-01-03 -0.274098 -0.386112
2013-01-04  0.844243  0.335021

In [26]:
df.loc['20130102', ['A', 'B']]

A    0.044198
B    0.530909
Name: 2013-01-02 00:00:00, dtype: float64

In [29]:
df.loc[dates[0], 'A']

-0.26445083230672767

In [30]:
df.iloc[3]

A    0.844243
B    0.335021
C    2.066941
D    0.469638
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.844243  0.335021
2013-01-05 -0.097006 -0.061110

In [34]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.044198  0.530909 -1.323004  2.187266
2013-01-03 -0.274098 -0.386112  1.312149 -0.735471

In [43]:
df = pd.DataFrame({'string': list('abc'),
                       'int64': list(range(1, 4)),
                       'uint8': np.arange(3, 6).astype('u1'),
                       'float64': np.arange(4.0, 7.0),
                       'bool1': [True, False, True],
                       'bool2': [False, True, False],
                       'dates': pd.date_range('now', periods=3),
                       'category': pd.Series(list("ABC")).astype('category')})
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2020-07-28 11:53:22.147076,A
1,b,2,4,5.0,False,True,2020-07-29 11:53:22.147076,B
2,c,3,5,6.0,True,False,2020-07-30 11:53:22.147076,C

In [44]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

In [45]:
df[df['bool1'] > 0]

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2020-07-28 11:53:22.147076,A
2,c,3,5,6.0,True,False,2020-07-30 11:53:22.147076,C

In [49]:
df2 = df.copy()
df2

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2020-07-28 11:53:22.147076,A
1,b,2,4,5.0,False,True,2020-07-29 11:53:22.147076,B
2,c,3,5,6.0,True,False,2020-07-30 11:53:22.147076,C

In [50]:
df2['E'] = ['one', 'four', 'two']
df2

,string,int64,uint8,float64,bool1,bool2,dates,category,E
0,a,1,3,4.0,True,False,2020-07-28 11:53:22.147076,A,one
1,b,2,4,5.0,False,True,2020-07-29 11:53:22.147076,B,four
2,c,3,5,6.0,True,False,2020-07-30 11:53:22.147076,C,two

In [51]:
df2[df2['E'].isin(['two', 'four'])]

,string,int64,uint8,float64,bool1,bool2,dates,category,E
1,b,2,4,5.0,False,True,2020-07-29 11:53:22.147076,B,four
2,c,3,5,6.0,True,False,2020-07-30 11:53:22.147076,C,two

In [62]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,3,4.0,True,False,2020-07-28 11:53:22.147076,A
1,b,2,4,5.0,False,True,2020-07-29 11:53:22.147076,B
2,c,3,5,6.0,True,False,2020-07-30 11:53:22.147076,C

# Refering to element in dataframe

In [63]:
# di.iat[row, columns] takes index
df.iat[0, 1] = 0
# OR
df.iloc[0, 1] = 2
# OR
df.loc[0,'dates']
# OR
df.at[2,'dates']
# OR
df.loc[dates[0], 'A'] = 2

In [66]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [67]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category,D
0,a,0,3,4.0,True,False,2020-07-28 11:53:22.147076,A,5
1,b,2,4,5.0,False,True,2020-07-29 11:53:22.147076,B,5
2,c,3,5,6.0,True,False,2020-07-30 11:53:22.147076,C,5